In [1]:
import pandas as pd
from typing import List

#  Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Return the result table in any order.

In [2]:
data = [
    [1, "Vote for Biden"],
    [2, "Let us make America great again!"]
]

df = pd.DataFrame(data, columns=["tweet_id", "content"])
df

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [3]:
def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    return(tweets[tweets['content'].str.len()>15][['tweet_id']])

In [4]:
invalid_tweets(df)

   tweet_id
1         2

# Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

In [5]:
data = {
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
}

df = pd.DataFrame(data)

df

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [6]:
def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
    employees[['bonus']]=employees[(employees['employee_id']%2!=0) & (~employees['name'].str.startswith('M'))][['salary']]
    employees.fillna(0,inplace=True)
    employees['bonus'].astype('int')
    return(employees[['employee_id','bonus']].sort_values('employee_id'))

In [7]:
calculate_special_bonus(df)

   employee_id   bonus
0            2     0.0
1            3     0.0
2            7  7400.0
3            8     0.0
4            9  7700.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  5 non-null      int64
 1   name         5 non-null      object
 2   salary       5 non-null      int64
 3   bonus        5 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 292.0+ bytes

# Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

In [9]:
data = {
    'user_id': [1, 2],
    'name': ['aLice', 'bOB']
}
df = pd.DataFrame(data)
df

   user_id   name
0        1  aLice
1        2    bOB

In [10]:
def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name']=users['name'].str.capitalize()
    return(users.sort_values('user_id'))

In [11]:
fix_names(df)

   user_id   name
0        1  Alice
1        2    Bob

# Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.

In [12]:
data = {
    'user_id': [1, 2, 3, 4, 5, 6, 7],
    'name': ['Winston', 'Jonathan', 'Annabelle', 'Sally', 'Marwan', 'David', 'Shapiro'],
    'mail': [
        'winston@leetcode.com',
        'jonathanisgreat',
        'bella-@leetcode.com',
        'sally.come@leetcode.com',
        'quarz#2020@leetcode.com',
        'david69@gmail.com',
        '.shapo@leetcode.com'
    ]
}
users = pd.DataFrame(data)
users

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
1        2   Jonathan          jonathanisgreat
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com
4        5     Marwan  quarz#2020@leetcode.com
5        6      David        david69@gmail.com
6        7    Shapiro      .shapo@leetcode.com

In [13]:
def valid_emails(users: pd.DataFrame) -> pd.DataFrame:
    return(users[users['mail'].str.match(r'^[A-Za-z][A-Za-z0-9._-]*@leetcode\.com$')])

In [14]:
valid_emails(users)

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

# Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix.

Return the result table in any order.

In [15]:
data = {
    'patient_id': [1, 2, 3, 4, 5],
    'patient_name': ['Daniel', 'Alice', 'Bob', 'George', 'Alain'],
    'conditions': ['YFEV COUGH', 'mDIAB100', 'DIAB100 MYOP', 'ACNE DIAB100', 'DIAB201']
}
df = pd.DataFrame(data)
df

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice      mDIAB100
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [16]:
def find_patients(patients: pd.DataFrame) -> pd.DataFrame:
    return(patients[patients['conditions'].str.contains(r'\bDIAB1.*')])

In [17]:
find_patients(df)

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100